; 3.1.任务一（1）：用汇编语言实现支持算术表达式的计算器
; 本任务为使用汇编语言设计与实现一个支持完整算术表达式求值的计算器。
; 要求能够支持包含整数和浮点数的四则运算的表达式的输入、计算和输出。具体
; 功能要求包括。
; 1. 输入
; a) 用户能够一次性输入表达式；
; b) 表达式格式如：(3.2+4.5)* (5.1 - 2.0) / 3.0
; 2. 计算
; a) 需支持加减乘除四则运算；
; b) 需支持对整数（含负数）的计算；
; c) 能够支持对小数的计算*；
; d) 需支持不少于3个运算符的表达式计算；
; e) 能够支持包含括号的表达式计算*；
; f) 能够从历史记录中选择两个表达式，在中间添加乘号后计算运算结
; 果*；
; 3. 输出
; a) 能够输出解题思路*（需显示首先计算哪两个数，然后计算哪两个数。
; 如3*（4+5）,先显示4+5=9，再显示3*9=27）；
; b) 需输出最终结果；
; c) 按上前头可以输出上一个公式；
; 4. 存储
; a) 用户输入的所有表达式需存到本地文件中；
; b) 需支持用户读取历史记录；
; c) 历史记录超过10条，支持翻页显示*；
; 5. 显示
; a) 需提供四个菜单：计算、读取历史记录、清空历史记录、退出；
; b) 每次计算完后需重新进入菜单。